/*
*React
это декларативная,эффективная и гибкая JavaScript 
библиотека для создания пользовательских интерфейсов (UI).

*Компоненты
это обычные функции.В таких функциях мы описываем,
как будет выглядеть компонент у нас на странице.

*Props
объект при помощи которого мы передаем данные с одного компонета в другой

*Что такое JSX и зачем он нужен?
Это JSX — расширение языка JavaScript. Мы рекомендуем использовать его, когда требуется объяснить React, как должен выглядеть UI. JSX напоминает язык шаблонов, наделённый силой JavaScript. JSX производит «элементы» React.
<a href="https://ru.reactjs.org/docs/introducing-jsx.html"><a/>

*/